Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/project2.c
                if(awaitSync){
                    // manage timing
                    // use each frames synch packet as time reference
                    // internal frame timer is only trusted to get us to the next immediate frame
                    // the rest of the timing depends on the sync packets

                    nrfConfigAsReceiverChecked();

                    p2Pkt pkt;
                    bool isValid;
                    if(p2GetData(&pkt, &isValid)){
                        if(isValid){

                            switch(pkt.header.type){

                                // timing synchronization
                                case P2_TYPE_ENTRY_SYNCH_PKT:
                                    // if is NOT form host
                                    if(pkt.header.from_frame != P2_SYNC_FRAME_INDEX)
                                        break;

                                    awaitSync = false;

                                    p2StartFrameTimerUS(P2_T_FRAME_US);

                                    // update local info using this packet, everyone trusts the same source
                                    p2CurrentFrame = P2DATAAS(p2PktSynch, pkt)->frame;
                                    p2IsFrameStartSetting(); // flush any triggers about a new frame

                                    // if is addressing the frame were occupying
                                    if(P2DATAAS(p2PktSynch, pkt)->frame == p2TxEndpoint){
                                        if(P2DATAAS(p2PktSynch, pkt)->frame_ttl == 0){
                                            // must have missed a reset packet
                                            // restart
                                            p2ClientJoin();
                                            break;
                                        }

                                        putsUart0("sync for me :333\n\r");
                                        // if nothing to send
                                        if(p2IsMsgQueueEmpty() || P2DATAAS(p2PktSynch, pkt)->frame_ttl <= 2){
                                            // send keepalive message to prevent timeout
                                            putsUart0("queuing keepalive\n\r");
                                            p2Pkt p;
                                            p.header.type = P2_TYPE_CMD_KEEPALIVE;
                                            p.header.data_length = sizeof(p2PktKeepAlive);
                                            p.header.from_frame = p2TxEndpoint;
                                            P2DATAAS(p2PktKeepAlive, p)->newTTL = 5; // use server default
                                            p2PushMsgQueue(p);
                                        }

                                    }

                                default:
                                    break;
                            }
                        }

                        putsUart0("clienting@");
                        {
                           char str[5];
                           snprintf(str, sizeof(str), "%2d ", p2TxEndpoint);
                           putsUart0(str);
                        }
                        putsUart0(" RX; valid: ");
                        putcUart0('0' + isValid);
                        putsUart0(" ");
                        p2PrintPacket(&pkt);
                        putsUart0("\n\r");

                    }

                } else { // sync packet has been handled
                    // assume timing is correct

                    // if time for this client to TX
                    if(p2CurrentFrame == p2TxEndpoint){
                        // tx pending messages

                        nrfConfigAsTransmitterChecked();

                        p2MsgQEntry * toSend = p2PopMsgQueue();
                        if(toSend){
                            nrfTransmit(toSend->pkt.raw_arr, P2_MAX_PKT_SIZE);
                        }

                    } // if time for server to TX
                    else if(p2CurrentFrame == P2_SYNC_FRAME_INDEX) {
                        bool isValid;
                        p2Pkt pkt;
                        if(p2GetData(&pkt, &isValid)){

                            // if is valid data
                            if(isValid){
                                p2ClientProcessPacket(&pkt);

                                switch(pkt.header.type){
                                    case P2_TYPE_CMD_RESET: {
                                            // if intended for this frame
                                            if(P2DATAAS(p2PktReset, pkt)->frame != p2TxEndpoint)
                                                break;

                                            // disconnect
                                            p2StopFrameTimer();
                                            p2State = P2_STATE_OFF;

                                            // if is not a retransmission
                                            if(! P2DATAAS(p2PktReset, pkt)->isEcho){
                                                // send disconnect msg back to ensure both parties understand
                                                //   can reuse the same packet

                                                // modify a few values
                                                pkt.header.from_frame = p2TxEndpoint;
                                                pkt.header.data_length = sizeof(p2PktReset);
                                                P2DATAAS(p2PktReset, pkt)->isEcho = true;
                                                P2DATAAS(p2PktReset, pkt)->frame = p2TxEndpoint;

                                                // mild effort to echo back the message
                                                if(p2PushMsgQueue(pkt)){
                                                    // great success!
                                                } else {
                                                    // it didn't make it, oh well, we did our due diligence ... thats what the timeout's for
                                                }
                                            }

