Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/project2.c
                                            // restart connection locally
                                            p2ClientJoin();
                                        } break;
                                }

                            }

                            putsUart0("clienting@");
                            {
                               char str[5];
                               snprintf(str, sizeof(str), "%2d ", p2TxEndpoint);
                               putsUart0(str);
                            }
                            putsUart0(" RX; valid: ");
                            putcUart0('0' + isValid);
                            putsUart0(" ");
                            p2PrintPacket(&pkt);
                            putsUart0("\n\r");
                        }
                    }
                }

            } break;
        default:;
    };
}

void p2HostProcessPacket(p2Pkt const * pkt){
    // assume packet is good

    switch(pkt->header.type){
        case P2_TYPE_CMD_JOIN_REQUEST:{
                // data validation
                bool isValid = true;
                {
                    if(
                                P2DATAAS(p2PktJoinRq, *pkt)->frame >= P2_FRAME_COUNT
                            ||  P2DATAAS(p2PktJoinRq, *pkt)->frame == p2TxEndpoint
                      ) {
                        isValid = false;
                    }
                }

                p2Pkt p;
                p.header.from_frame = p2TxEndpoint;
                p.header.data_length = sizeof(p2PktJoinResponse);
                p.header.type = P2_TYPE_CMD_JOIN_RESPONSE;

                uint8_t sourceFrame = P2DATAAS(p2PktJoinRq, *pkt)->frame;
                P2DATAAS(p2PktJoinResponse, p)->frame = sourceFrame;

                // accept if frame not already occupied
                P2DATAAS(p2PktJoinResponse, p)->join_request_accepted =
                        isValid ?
                                (p2FrameMetas[sourceFrame].ttl == 0)
                        :       false;

                // if accepting
                if(P2DATAAS(p2PktJoinResponse, p)->join_request_accepted){
                    // make sure no double accepting
                    for(uint8_t i = 0; i < P2_MSG_QUEUE_SIZE; i++){
                        if(p2MsgQueue[i].enabled && p2MsgQueue[i].pkt.header.type == P2_TYPE_CMD_JOIN_RESPONSE){
                            P2DATAAS(p2PktJoinResponse, p2MsgQueue[i].pkt)->join_request_accepted = false;
                            break;
                        }
                    }
                    p2FrameMetas[sourceFrame].ttl = P2_FRAME_DEFAULT_TTL;
                }

                p.header.crc = p2CalcPacketCRC(&p);
                p2PushMsgQueue(p);
            }break;

        case P2_TYPE_CMD_RESET:
            if(P2DATAAS(p2PktReset, *pkt)->isEcho){

            } else {
                // send reset packet with isEcho true
                p2Pkt p;
                p.header.from_frame = p2TxEndpoint;
                p.header.data_length = sizeof(p2PktReset);
                p.header.type = P2_TYPE_CMD_RESET;
                P2DATAAS(p2PktReset, p)->frame = pkt->header.from_frame;
                P2DATAAS(p2PktReset, p)->isEcho = true;
                p2PushMsgQueue(p);
            }
        case P2_TYPE_CMD_DISCONNNECT:
            p2FrameMetas[pkt->header.from_frame].ttl = 0;
            break;

        case P2_TYPE_CMD_KEEPALIVE: {
                if(P2DATAAS(p2PktSynch, *pkt)->frame_ttl)
                    p2FrameMetas[pkt->header.from_frame].ttl = P2DATAAS(p2PktSynch, *pkt)->frame_ttl;
                else
                    p2FrameMetas[pkt->header.from_frame].ttl = 6;
            }break;

        default:
            putsUart0("unhandled type ");
            break;

    }
}

void p2ClientProcessPacket(p2Pkt const * pkt){
    // assume packet is good

    switch(pkt->header.type){
        case P2_TYPE_CMD_JOIN_RESPONSE:{
                // if intended for this frame
                if(P2DATAAS(p2PktJoinResponse, *pkt)->frame == p2TxEndpoint){
                    // reset frame
                    p2Pkt p;
                    p.header.data_length = sizeof(p2PktReset);
                    p.header.from_frame = p2TxEndpoint;
                    p.header.type = P2_TYPE_CMD_RESET;
                    P2DATAAS(p2PktReset, p)->frame = p2TxEndpoint;
                    P2DATAAS(p2PktReset, p)->isEcho = false;
                    p2PushMsgQueue(p);
                }
            }

        case P2_TYPE_CMD_RESET: // already handled by client loop
            // if intended for this device
            if(P2DATAAS(p2PktReset, *pkt)->frame != p2TxEndpoint)
                break;

        case P2_TYPE_CMD_DISCONNNECT:
            // if intended for this device
            if(P2DATAAS(p2PktDisconnect, *pkt)->frame != p2TxEndpoint)
                break;

            // disconnect locally
            p2StopFrameTimer();
            p2State = P2_STATE_OFF;

            // restart connection locally
            p2ClientJoin();

            break;

        case P2_TYPE_CMD_JOIN_REQUEST:
            // do nothing
            putsUart0("received msg intended for server??\n\r");
            break;

        case P2_TYPE_ENTRY_SYNCH_PKT:
            // un oh, desync
//            p2StartFrameTimerUS(1); // abort this loop
            break;

        default:{
                char str[10];
                putsUart0("unhandled type ");
                snprintf(str, sizeof(str), "%02d, ", pkt->header.type);
                putsUart0(str);
            }break;
    }

}

p2MsgQEntry * p2PushMsgQueue(p2Pkt pkt){

    for(uint8_t i = 1; i < P2_MSG_QUEUE_SIZE; i++)
        if(!p2MsgQueue[i].enabled){
            p2MsgQueue[i].enabled = true;

            pkt.header.crc = p2CalcPacketCRC(&pkt);
            p2MsgQueue[i].pkt = pkt;

            return p2MsgQueue + i;
        }

    return NULL;
}

p2MsgQEntry * p2PopMsgQueue(){
    for(uint8_t i = 0; i < P2_MSG_QUEUE_SIZE; i++)
        if(p2MsgQueue[i].enabled){
            p2MsgQueue[i].enabled = false;
            return p2MsgQueue + i;
        }

