Gregification/cse-labs/homelab/tm4c123gfiddle/n24l01_TXRX_demo/src/project2.c
    return NULL;
}

bool p2IsMsgQueueEmpty(){
    p2MsgQEntry * spot = p2PopMsgQueue(); // search using the pop funciton
    if(spot){

        spot->enabled = true; // dont actually pop the element

        return false;

    } else
        return true;
}

bool p2IsPacketValid(p2Pkt const * pkt){
    return
            pkt->header.from_frame < P2_FRAME_COUNT
        &&  pkt->header.type <= P2_TYPE_LAST
        &&  pkt->header.crc == p2CalcPacketCRC(pkt)
        ;
}

// baselined off of Jason Losh's "initTimer()" function
void p2StartFrameTimerUS(uint32_t timeToNextFrame_us){
    // Enable clocks
    SYSCTL_RCGCTIMER_R |= SYSCTL_RCGCTIMER_R3;
    _delay_cycles(3);
    // Configure Timer 3 for 1uS tick
    TIMER3_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer before reconfiguring
    TIMER3_CFG_R = TIMER_CFG_32_BIT_TIMER;           // configure as 32-bit timer (A+B)
    TIMER3_TAMR_R = TIMER_TAMR_TAMR_1_SHOT;          // configure for one shot mode (count down)
    TIMER3_TAILR_R = timeToNextFrame_us * 40;        // set load value
    TIMER3_CTL_R |= TIMER_CTL_TAEN;                  // turn-on timer
    TIMER3_IMR_R |= TIMER_IMR_TATOIM;                // turn-on interrupt
    NVIC_EN1_R |= 1 << (INT_TIMER3A-(32+16));        // turn-on interrupt 51 (TIMER3A)
}

void p2StopFrameTimer(){
    TIMER3_CTL_R &= ~TIMER_CTL_TAEN;                 // turn-off timer
}

void p2OnFrameTimeIsr(){
    p2CurrentFrame += 1;
    p2CurrentFrame %= P2_FRAME_COUNT;
    newFrame = true;

    TIMER3_ICR_R = TIMER_ICR_TATOCINT;
}

void p2PrintPacket(p2Pkt const * p){
    putsUart0("{");

    char str[10];

    putsUart0("crc: ");
    snprintf(str, sizeof(str), "%02x, ", p->header.crc);
    putsUart0(str);

    putsUart0("len: ");
    snprintf(str, sizeof(str), "%02d, ", p->header.data_length);
    putsUart0(str);

    putsUart0("frame: ");
    snprintf(str, sizeof(str), "%02d, ", p->header.from_frame);
    putsUart0(str);

    putsUart0("type: ");
    switch(p->header.type){
        case P2_TYPE_CMD_RESET:
            putsUart0("CMD_RESET ,");
            putsUart0("frame: ");
            snprintf(str, sizeof(str), "%02d, ", P2DATAAS(p2PktReset, (*p))->frame);
            putsUart0(str);
            putsUart0("echo: ");
            putcUart0('0' + P2DATAAS(p2PktReset, (*p))->isEcho);
            break;
        case P2_TYPE_CMD_DISCONNNECT:
            putsUart0("CMD_DISCONNNECT ,");
            break;
        case P2_TYPE_CMD_JOIN_REQUEST:{
                putsUart0("CMD_JOIN_REQUEST ,");
                putsUart0("frame: ");
                snprintf(str, sizeof(str), "%02d, ", P2DATAAS(p2PktJoinRq, (*p))->frame);
                putsUart0(str);
            }break;
        case P2_TYPE_CMD_JOIN_RESPONSE:
            putsUart0("CMD_JOIN_RESPONSE ,");
            putsUart0("frame: ");
            snprintf(str, sizeof(str), "%02d, ", P2DATAAS(p2PktJoinResponse, (*p))->frame);
            putsUart0(str);
            putsUart0("accepted: ");
            putcUart0('0' + P2DATAAS(p2PktJoinResponse, (*p))->join_request_accepted);
            break;
        case P2_TYPE_CMD_KEEPALIVE:
            putsUart0("CMD_KEEPALIVE ,");
            putsUart0("new TTL: ");
            snprintf(str, sizeof(str), "%d, ", P2DATAAS(p2PktKeepAlive, *p)->newTTL);
            putsUart0(str);
            break;
        case P2_TYPE_ENTRY_SYNCH_PKT:{
                putsUart0("ENTRY_SYNCH_PKT ,");
                p2PktSynch * s = (p2PktSynch *)p->data;
                putsUart0("of frame: ");
                snprintf(str, sizeof(str), "%02d, ", s->frame);
                putsUart0(str);
                putsUart0("nxt avl frme: ");
                snprintf(str, sizeof(str), "%02d, ", s->next_avaliable_frame);
                putsUart0(str);
                putsUart0("frame ttl: ");
                snprintf(str, sizeof(str), "%02d, ", s->frame_ttl);
                putsUart0(str);
            }break;
        case P2_TYPE_GLASS_BRAKE_SENSOR:{
                putsUart0("GLASS_BRAKE_SENSOR ,");
                putsUart0("alarm: ");
                snprintf(str, sizeof(str), "%d, ", P2DATAAS(p2PktEPGlassBreakSensor, *p)->alarm);
                putsUart0(str);
                putsUart0("batt low: ");
                snprintf(str, sizeof(str), "%d, ", P2DATAAS(p2PktEPGlassBreakSensor, *p)->battery_low);
                putsUart0(str);
                putsUart0("batt level: ");
                snprintf(str, sizeof(str), "%03d, ", P2DATAAS(p2PktEPGlassBreakSensor, *p)->battery_level);
                putsUart0(str);
            }break;
        default:{
                putsUart0("unknown (");
                snprintf(str, sizeof(str), "%02d) ", p->header.type);
                putsUart0(str);

                putsUart0(", raw:  ");
                for(int i = 0; i < P2_MAX_PKT_SIZE; i++){
                    snprintf(str, sizeof(str), "%02x ", p->raw_arr[i]);
                    putsUart0(str);
                }
            }break;
    }

    putsUart0("}");
}

void p2PrintFrameMetas(){
    putsUart0("FM{");

    char str[8];

    for(uint8_t i = 0; i < P2_FRAME_COUNT; i++){
        snprintf(str, sizeof(str), "%d{", i);
        putsUart0(str);
        snprintf(str, sizeof(str), "ttl:%03d,", p2FrameMetas[i].ttl);
        putsUart0(str);
        putsUart0("} ");
    }
    putsUart0("}");
}

//bool p2isPacketACommand(p2PktEntryHeader const pkt){
//    return pkt.data_length == 1;
//}
//
//p2PktEntryHeader * p2GetNextEntry(p2PktEntryHeader const * formerPkt){
//    if(formerPkt && !formerPkt->is_last_entry){
//        return  (p2PktEntryHeader *)(
//                    ((uint8_t*)formerPkt)
//                    + sizeof(p2PktEntryHeader)
//                    + (formerPkt->data_length)
//                );
//    }
//    return 0;
//}

bool p2GetData(p2Pkt * pkt, bool * isValid){
    nrfConfigAsReceiverChecked();

   if(nrfIsDataAvaliable()){
       if(nrfGetRXData(pkt->raw_arr, sizeof(p2Pkt))){
           *isValid = p2IsPacketValid(pkt);
           return true;
       }
   }

   return false;
}

#define CRC_POLY    0x23
#define CRC_HB      BV(7)
uint8_t p2CalcPacketCRC(p2Pkt const * p){
    uint8_t const * data = (uint8_t *)p + 1;

    uint8_t crc = ~0;

    bool xor;
    uint8_t test;

    uint8_t i;
    for(i = 0; i < sizeof(p2Pkt)-1; i++){
        test = CRC_HB;

        while(test) {
            xor = crc & CRC_HB;

            crc <<= 1;

            if(data[i] & test)
                crc += 1;

            if(xor)
                crc ^= CRC_POLY;

            test >>= 1;
        }
    }

    // one more time without data
    test = CRC_HB;
    while(test) {
        xor = crc & CRC_HB;
        crc <<= 1;
        if(xor)
            crc ^= CRC_POLY;
        test >>= 1;
    }

    return crc;
}

//uint8_t * p2GetPktEntryDataStart(p2PktEntryHeader const * pkh){
//    return (uint8_t *)(pkh + 1);
//}
//
//uint8_t * p2AppendPktEntry(p2Pkt const * pkt, uint8_t * offset, p2PktEntryHeader eh, void const * data){
//    if(
//            (offset - ((uint8_t *)pkt)) // remaining space
//            <
//            (sizeof(p2PktEntryHeader) + eh.data_length) // space needed
//      )
//        return 0;
//
//    // copy header
//    for(uint8_t i = 0; i < sizeof(p2PktEntryHeader); i++)
//        offset++[0] = ((uint8_t *)&eh)[i];
//
//    // copy data
//    for(uint8_t i = 0; i < eh.data_length; i++)
//        offset++[0] = ((uint8_t *)data)[i];
//
//    return offset;
//}
